// ------------------------------------------------------------------------------
// name: 项目全局配置
// note: 该配置文件将被独立打包，作用于运行时全局参数，请勿引用外部资源
// author: 喵大斯( mschool.tech )
// created: 2019/8/23 22:18
// ------------------------------------------------------------------------------

const DEBUG = process.env.NODE_ENV === 'development';

/**
 * 该配置主要用于初始化 axios 请求参数，可参照 axios 的默认配置进行设置
 */
module.exports = {
  // ----------------------------------------
  // 页面模块级配置
  // ----------------------------------------

  // 全局配置
  global: {},

  // 启动页配置
  startup: {}

};
